src/main/resources/perf_test.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: Monitoring-HealthCheck

scenarios:
  Monitoring-HealthCheck:
    think-time: 0.75
    requests:
      - http://<host>:<port>/monitor/healthcheck

reporting:
  - module: final-stats
    summary: true
    percentiles: true
    test-duration: true
    dump-csv: perf_test.csv